---
kind: type
id: T:Autodesk.Revit.DB.FaceSplitter
source: html/ba55587f-4f1e-7f4c-5b1c-864e10cab304.htm
---
# Autodesk.Revit.DB.FaceSplitter

Represents an element that splits a face.

## Syntax (C#)
```csharp
public class FaceSplitter : Element
```